Revit 2024 API
Transform2D.Origin Property
 The image of (0, 0) under OfPoint(UV). This defines the translational part of the transform.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public UV Origin { get; set; }
Visual Basic
Public Property Origin As UV
	Get
	Set
Visual C++
public:
property UV^ Origin {
	UV^ get ();
	void set (UV^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Transform2D Class
Autodesk.Revit.DB Namespace